app/Http/Controllers/BlogController.php

select * from `blogs`
---
    public function index()
    {
        $blogs = Blog::all();

select * from `blogs` where `slug` = 'hieu-dep-trai' limit 1
---
    public function show($slug)
    {
        $blog = Blog::where('slug', $slug)->firstOrFail();