app/Http/Controllers/CouponController.php

    public function index()
    {
        $today = Carbon::now();

        $coupons = Coupon::get();
---
select * from `coupons`