app/Http/Controllers/HomeController.php

    public function index()
    {
        $today = Carbon::now();

        $featuredCoupon = Coupon::where('isfeatured', true)
            ->first();

        $bannerHomeImages = Image::where('imagetype', ImageTypeEnum::BANNERHOME)->get();
        $bannerMenuImages = Image::where('imagetype', ImageTypeEnum::BANNERMENU)->get();

        $coupons = Coupon::latest()
            ->take(2)
            ->get();
---
select * from `coupons` where `isfeatured` = 1 limit 1
select * from `coupons` order by `created_at` desc limit 2