app/Http/Controllers/MenuController.php

select * from `menus` limit 1
---
    public function index()
    {
        $menus = Menu::all();