app/Providers/AppServiceProvider.php

    public function boot(): void
    {
        //
        Blog::observe(BlogObserver::class);
        Image::observe(ImageObserver::class);
        Coupon::observe(CouponObserver::class);
        Menu::observe(MenuObserver::class);
        Setting::observe(SettingObserver::class);

        view()->composer('*', function ($view) {
            $settings = Setting::all()->keyBy('title');
---
select * from `settings`